 დავალება 1
#  დაწერეთ პაროლის გენერატორი.
# დავალების შესრულებაში დაგეხმარებათ: random მოდული, while ან for ციკლი, list,
# სტრიქონის ფორმატირება.
# input ის მეშვეობით უნდა შეგვეძლოს მითითება რა სიგრძის პაროლი გვინდა და რა
# სიმბოლეობიდან გენერირდება იგი: პაროლის სიგრძეს ირჩევს მომხმარებელი, უნდა თუ
# არა სიმბოლოები, რიცხვები, დიდი/პატარა ასოები (ლათინურად) თუ ქართულს შემოიტანს
# უნდა დაუწერო რომ “შეიყვანე მხოლოდ ლათინური ასოები”
# **უნდა გვქონდეს 4 ინფუთი - სიგრძე / რიცხვები უნდა თუ არა / დიდი და პატარა ასოები თუ
# უნდა / თუ უნდა სიმბოლოები
# **უნდა დაწეროთ ლოგიკა იმის მიხედვით რასაც აირჩევს მომხმარებელი და ბოლოს
# დაუგენერიროთ პაროლი.


def main():
    while True:
        sz = input("რამდენ სიმბოლოიანი პაროლი გინდათ: ")
        if sz.isdigit() and int(sz) > 0:
            sz = int(sz)
            break
        else:
            print("თქვენ არასწორი მნიშვნელობა შემოიტანეთ")
    use_digits = input("შეიყვანე ციფრები? (y/n): ").lower() == 'y'
    use_letters = input("შეიყვანე დიდი/პატარა ასოები? (y/n): ").lower() == 'y'
    use_symbols = input("შეიყვანე სიმბოლოები? (y/n): ").lower() == 'y'

    if use_letters:
        check = input("მხოლოდ ლათინური ასოებია? (y/n): ").lower()
        if check != 'y':
            print("შეიყვანე მხოლოდ ლათინური ასოები.")
            return
    chars = ""
    if use_letters:
        chars += string.ascii_letters
    if use_digits:
        chars += string.digits
    if use_symbols:
        chars += string.punctuation

    if not chars:
        print("მონაცემები არასწორია, პაროლის გენერირება შეუძლებელია.")
        return

    password = ''.join(random.choice(chars) for _ in range(sz))
    print("გენერირებული პაროლი:", password)

main()

# დავალება 2. დაწერე ფუნქცია (ფიბონაჩის რიგი) - *რა არის ფიბონაჩი - ბოლო ორი ელემენტის ჯამით ვამატებთ
# ახალ რიცხვს*, სანამ სიგრძე არ გახდება მომხმარებლის მიერ შემოყვანილი რიცხვი, აუცილებლად
# უნდა შემოიტანოს რიცხვი, სხვა რამის შემოტანის დროს უნდა შემოწმდეს რა შემოიტანა
# მომხმარებელმა და უნდა დაუსახელო აღნიშნული და უთხრა რომ მხოლოდ რიცხვი შემოიტანოს. მაგ:
# შემოიტანა სიმბოლო, უნდა უთხრა შენ შემოიტანე სიმბოლო არასწორია, მხოლოდ რიცხვი!

# 1 1 2 3 5 8
def fib(n):
    if n <= 2:
        return 1
    return fib(n-1) + fib(n-2)

numb = int(input("შემოიტანეთ მთელი მნიშვნელობა: "))
print(f'{numb} -ის შესაბამისი ფიბონაჩის მნიშვნელობაა: {fib(numb)}')


# დავალება 3
# ზედმეტსახელების გენერატორი
# მომხმარებელს შემოაქვს მხოლოდ ერთი სიტყვა(სხვა შემთხვევები დაბლოკე) და შენ სთავაზობ 5
# ზედმეტსახელს ამ სიტყვასთან კავშირში.
